In [1]:
import pandas as pd

In [2]:
# Data with missing value

df = pd.read_csv("data_cleaning_sample.csv")

In [3]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [4]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [7]:
# Check where the null data is present

df.isnull()

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False   True  False   False  False      False
2  False  False  False   False  False      False
4  False  False  False   False  False      False
5   True  False  False   False  False       True

In [8]:
# Check per column null value

df.isnull().sum()        # Count missing per column

Name         1
Age          1
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [9]:
df.dropna()     # By default (axis = 0) for row

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12-11-2019

In [10]:
df.dropna(axis = 1)    # for column

# Use when your big data have large missing value in your column then you drop your whole column

          City Gender              Email
0     New York      F  alice@example.com
1        Delhi      M    charlie@example
2  Los Angeles      M    bob@example.com
4       Mumbai      M  david@example.com
5        Delhi      F     eve@domain.com

In [11]:
# Fillna is used when missing value is less

df.fillna(0)

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5        0  28.0        Delhi      F     eve@domain.com           0

In [12]:
# If the colums contains large value like (Cr., Lakh.) if we fill 0 in this 
# It will effect the statical info like mean 
# You can use alternate option

# Option 1:-
df["Age"].fillna(df["Age"].mean())

0    25.00
1    26.25
2    30.00
4    22.00
5    28.00
Name: Age, dtype: float64

In [13]:
# Option 2 :-  Forward Fill

# df.fillna(method="ffill")

df.ffill(inplace=True)

In [14]:
# Option 3 :- Backward Fill

# df.fillna(method="bfill")    # This syntax is deprecated soon

# Why I use inplace=True in forward because first row data is complete so it replace NaN properly 

df.bfill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    David  28.0        Delhi      F     eve@domain.com  12-11-2019

In [15]:
# You can also check specific pair is duplicated or not

df.duplicated(subset=["Age","Gender"])

0    False
1    False
2    False
4    False
5    False
dtype: bool

In [16]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    David  28.0        Delhi      F     eve@domain.com  12-11-2019

# String Operation in Pandas

In [17]:
# Most of the string method are supported in pandas

df["Name"].str.lower()

0      alice
1    charlie
2        bob
4      david
5      david
Name: Name, dtype: object

In [18]:
type(df["Name"].str.lower())

pandas.core.series.Series

In [19]:
# String is not supported inplace=True
# You can use alternate option

df["Name"] = df["Name"].str.lower()

In [20]:
df

      Name   Age         City Gender              Email   Join Date
0    alice  25.0     New York      F  alice@example.com  01-05-2021
1  charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    david  22.0       Mumbai      M  david@example.com  12-11-2019
5    david  28.0        Delhi      F     eve@domain.com  12-11-2019

In [21]:
df["City"].str.contains("delhi", case=False) # Checks if 'delhi' is in the city name, case-insensitive.

0    False
1     True
2    False
4    False
5     True
Name: City, dtype: bool

In [22]:
type(df["City"].str.contains("delhi", case=False) )

pandas.core.series.Series

In [23]:
df["Email"].str.split("@")[0]

['alice', 'example.com']

In [24]:
type(df["Email"].str.split("@")[0])

list

In [25]:
df["Email"].str.split("@")

0    [alice, example.com]
1      [charlie, example]
2      [bob, example.com]
4    [david, example.com]
5       [eve, domain.com]
Name: Email, dtype: object

In [26]:
type(df["Email"].str.split("@"))

pandas.core.series.Series

In [27]:
df["Age"] = df["Age"].astype(int)

In [28]:
df["Category"] = df["City"].astype("category")

In [29]:
df

,Name,Age,City,Gender,Email,Join Date,Category
0,alice,25,New York,F,alice@example.com,01-05-2021,New York
1,charlie,25,Delhi,M,charlie@example,20-07-2021,Delhi
2,bob,30,Los Angeles,M,bob@example.com,15-06-2020,Los Angeles
4,david,22,Mumbai,M,david@example.com,12-11-2019,Mumbai
5,david,28,Delhi,F,eve@domain.com,12-11-2019,Delhi

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 5
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       5 non-null      object
 1   Age        5 non-null      int64
 2   City       5 non-null      object
 3   Gender     5 non-null      object
 4   Email      5 non-null      object
 5   Join Date  5 non-null      object
 6   Category   5 non-null      category
dtypes: category(1), int64(1), object(5)
memory usage: 661.0+ bytes

In [31]:
df["Age Group"] = df["Age"].apply(lambda x: "Adult" if x > 25 else "Minor")

In [32]:
# You can also do this by simple funciton

def is22or25(x):
    return "Yes" if x == 22 or x == 25 else "No"

df["Age 25 or 22"] = df["Age"].apply(is22or25)

In [33]:
df

,Name,Age,City,Gender,Email,Join Date,Category,Age Group,Age 25 or 22
0,alice,25,New York,F,alice@example.com,01-05-2021,New York,Minor,Yes
1,charlie,25,Delhi,M,charlie@example,20-07-2021,Delhi,Minor,Yes
2,bob,30,Los Angeles,M,bob@example.com,15-06-2020,Los Angeles,Adult,No
4,david,22,Mumbai,M,david@example.com,12-11-2019,Mumbai,Minor,Yes
5,david,28,Delhi,F,eve@domain.com,12-11-2019,Delhi,Adult,No

In [34]:
# New Use Case of Map 

# Map Dictionary()

# In map it is compulsary that all the values that are in columns were also present in Dictionary so that it will replace otherwise it replacre all element with NaN

gender_map = {"M": "Male", "F": "Female", "O": "Other"}
df["Gender"] = df["Gender"].map(gender_map)

In [35]:
df

,Name,Age,City,Gender,Email,Join Date,Category,Age Group,Age 25 or 22
0,alice,25,New York,Female,alice@example.com,01-05-2021,New York,Minor,Yes
1,charlie,25,Delhi,Male,charlie@example,20-07-2021,Delhi,Minor,Yes
2,bob,30,Los Angeles,Male,bob@example.com,15-06-2020,Los Angeles,Adult,No
4,david,22,Mumbai,Male,david@example.com,12-11-2019,Mumbai,Minor,Yes
5,david,28,Delhi,Female,eve@domain.com,12-11-2019,Delhi,Adult,No

In [36]:
# But in replace not compulsary to change all the values

df["City"] = df["City"].replace({"Delhi": "New Delhi", "Mumbai": "New Mumbai"})

In [37]:
df

,Name,Age,City,Gender,Email,Join Date,Category,Age Group,Age 25 or 22
0,alice,25,New York,Female,alice@example.com,01-05-2021,New York,Minor,Yes
1,charlie,25,New Delhi,Male,charlie@example,20-07-2021,Delhi,Minor,Yes
2,bob,30,Los Angeles,Male,bob@example.com,15-06-2020,Los Angeles,Adult,No
4,david,22,New Mumbai,Male,david@example.com,12-11-2019,Mumbai,Minor,Yes
5,david,28,New Delhi,Female,eve@domain.com,12-11-2019,Delhi,Adult,No